import module
name1="file 1.txt"
name2="file 2.txt"
module.File_Create(name1)  # створити файл із списком автомобілів автосалону
print("Whole auto list (file 1):")
module.Output(name1) # вивести файл із списком автомобілів автосалону
module.NewAutosListCreate(name1, name2) # створити список нових автомобілів
print("New autos' list (file 2):")
module.Output(name2) # вивести список нових автомобілів
module.AutosReleasedAfter(name1) # вивести інформацію про автомобілі, які були випущені не раніше вказаного року

# Створити файл із списком автомобілів автосалону: назва, дата випуску, дата надходження у продаж.
# Створити список нових автомобілів (які надійшли у продаж не більш як через 2 місяці після випуску).
# Вивести інформацію про автомобілі, які були випущені не раніше вказаного року.