#include "Header.h"

int main()
{
    string name1 = "file 1.txt", name2 = "file 2.txt";
    File_Create(name1); //створити файл із списком автомобілів автосалону
    cout << "\nWhole auto list (file 1):" << endl;
    Output(name1); //вивести файл із списком автомобілів автосалону
    NewAutosListCreate(name1, name2); //створити список нових автомобілів
    cout << "\nNew autos' list (file 2):" << endl;
    Output(name2); //вивести список нових автомобілів
    AutosReleasedAfter(name1); //вивести інформацію про автомобілі, які були випущені не раніше вказаного року
    return 0;
}

/*Створити файл із списком автомобілів автосалону: назва, дата випуску, дата надходження у продаж.
Створити список нових автомобілів (які надійшли у продаж не більш як через 2 місяці після випуску).
Вивести інформацію про автомобілі, які були випущені не раніше вказаного року.*/